app/controllers/cart_controller.rb

  def add
    @product = Product.find(params[:id])
    item = @order.order_items.find_by_product_id(@product.id)
    if item
      item.quantity = item.quantity + 1
    else
      item = @order.order_items.new :product => @product
    end
    item.save
---
SELECT * FROM "products" WHERE ("products"."id" = 1)
SELECT "order_items".id FROM "order_items" WHERE ("order_items"."product_id" = 1 AND "order_items".order_id = 72 AND "order_items".id <> 16) LIMIT 1
SELECT * FROM "orders" WHERE ("orders"."id" = 72)
SELECT sum("order_items".total) AS sum_total FROM "order_items" WHERE (("order_items".order_id = 72) AND ("order_items".order_id = 72))
INSERT INTO "order_items" ("order_id", "updated_at", "product_id", "quantity", "total", "created_at") VALUES(13, '2010-06-22 22:36:26', 1, 1, 5.0, '2010-06-22 22:36:26')
INSERT INTO "orders" ("status", "updated_at", "total", "user_id", "created_at") VALUES(NULL, '2010-06-22 22:35:44', NULL, NULL, '2010-06-22 22:35:44')
UPDATE "order_items" SET "total" = 10.0, "updated_at" = '2010-06-22 23:33:13', "quantity" = 2 WHERE "id" = 16
UPDATE "orders" SET "total" = 25.0, "updated_at" = '2010-06-22 23:33:13' WHERE "id" = 72

  def remove
    oi = @order.order_items.find(params[:id])
    oi.destroy
    @order.update_attribute :total, @order.order_items.sum(:total)
---
SELECT * FROM "order_items" WHERE ("order_items"."id" = 23 AND ("order_items".order_id = 74))
SELECT * FROM "orders" WHERE ("orders"."id" = 74)
SELECT sum("order_items".total) AS sum_total FROM "order_items" WHERE ("order_items".order_id = 74)
DELETE FROM "order_items" WHERE "id" = 23
UPDATE "orders" SET "total" = 5.0, "updated_at" = '2010-06-24 00:23:00' WHERE "id" = 74

  def update
    # raise params.inspect
    for id, quantity in params[:item]
      @order.order_items.find(id).update_attribute :quantity, quantity
    end
    redirect_to :action => :index
  end

end

=begin
item = @order.order_items.find_by_product_id(@product.id)
if item
  new_quantity = item.quantity+1
  item.update_attributes :quantity => new_quantity, :total => @product.price * new_quantity
else
  @order.order_items.create :product => @product, :quantity => 1, :total => @product.price
---
SELECT * FROM "order_items" WHERE ("order_items"."id" = 24 AND ("order_items".order_id = 74))
SELECT * FROM "orders" WHERE ("orders"."id" = 73)
SELECT sum("order_items".total) AS sum_total FROM "order_items" WHERE ("order_items".order_id = 74)
UPDATE "order_items" SET "total" = 10.0, "updated_at" = '2010-06-24 00:33:29', "quantity" = 2 WHERE "id" = 25
SELECT * FROM "orders" LIMIT 1
SELECT * FROM "products" WHERE ("products"."id" = 5)