app/controllers/cities_controller.rb

SELECT * FROM "cities" WHERE ("cities"."id" = 1)
---
  def show
    @city = City.find(params[:id])

SELECT * FROM "cities" WHERE ("cities"."id" = 1)
---
  def edit
    @city = City.find(params[:id])

INSERT INTO "cities" ("name", "updated_at", "state", "created_at") VALUES('Porto Alegre', '2010-06-21 22:41:26', 'RS', '2010-06-21 22:41:26')
---
  def create
    @city = City.new(params[:city])

    respond_to do |format|
      if @city.save