app/controllers/home_controller.rb

SELECT * FROM "products" WHERE ("products"."id" = 1)
---
  def product
    @product = Product.find(params[:id])

SELECT * FROM "users" WHERE ("users"."login" = 'dasdad' AND "users"."password" = 'asdasd') LIMIT 1
---
  def login
    return unless request.post?
    user = User.find_by_login_and_password params[:login],params[:password]