app/controllers/products_controller.rb

  def list
    @products = Product.all
---
SELECT * FROM "products"

  def save
	# raise params.inspect // Exibe o conteúdo do request
	@product = Product.new params[:product]
	if @product.save
---
INSERT INTO "products" ("name", "updated_at", "price", "front", "stock", "description", "created_at") VALUES(NULL, '2010-06-18 23:29:21', NULL, NULL, NULL, NULL, '2010-06-18 23:29:21')